{
    "essay": "Social media algorithms play a crucial role in formation of the content we absorb daily and hence are important factors in shaping our personalities. Usually, a person spends a good portion of their day on social media. The algorithms, utilizing machine learning and AI, learn with each user interaction, the type of content a particular user likes or dislikes. The algorithms are so particular that each interaction, including a split second spent viewing a post, is also determinant of what content will be shown to us in the upcoming time.\n\nConsuming a particular type of content daily impacts how our minds work. If a significant part of our day is spent in consuming the same content daily, it shapes our thinking and perception patterns. If the consumption of media is on the negative side like pornography, violence and dark web stuff, it undoubtedly makes a person addicted to these content types and the addictions can be far-fetched and have deep roots in the user's future habits.\nSimilarly, if the content that the algorithm shows is positive like religious or constructive and knowledgeable stuff, it adds to our productivity and helps keep us up to date.\nNow, the problem with algorithms is, they do not let a user view randomized stuff and break patterns. If a person has a negative algorithm in the sense that a person's social media algorithm revolves around dark web, he will have a difficult time in breaking out of the pattern or addiction because the algorithm pulls the user back into viewing the same kind of content. An algorithm trained on weeks of social media usage patterns takes will and time to learn the user's new or changing pattern. This will and time to unlearn the old pattern is crucial for addicts. If the willpower is not strong enough, the old addictions paired with the algorithm's pull, will force the user back into the whirlwind of the stuff he was consuming. This adds to the complications of addictions.\nIn light of the above points discussed, it is safe to say that social media algorithms play an important part in shaping people's identities. ",
    "score": 0.0
}